function solution(str){
   var arr = str.split('')
   var res = [] // Сначала я создал массив из строки и массив для сохранения результата

   for(let i = 0; i<arr.length; i+=2){ //После этого я использовал цикл для перебора массива, и на каждой итерации я буду добавлять два к значению "i", так что он повторяет каждые два элемента.
     if(arr[i+1]) res.push(arr[i]+arr[i+1]) //Внутри этого цикла я проверю, есть ли другой элемент рядом с тем, который повторяется, если у него есть другой элемент, он поместит текущий элемент и следующий элемент в результирующий массив, если нет, он поместит текущий элемент плюс подчеркивание.
     else res.push(arr[i]+'_')
   }

  return res
}

